In [ ]:
!pip install update
!pip install pandas

In [3]:
import pandas as pd
import numpy as np

In [4]:
pd.__version__

'1.0.5'

# Pandas ê°œìš”

- panda ìë£Œêµ¬ì¡° 
    - object : ë¬¸ìì—´ 
- Series
    df.info()
    - ìƒì„± 
        - pd.Series([ ê°’ ë°°ì—´], index=[ì¸ë±ìŠ¤ ë°°ì—´])
    - ëª…ëª…
        - ì‹œë¦¬ì¦ˆê°ì²´.name = name/ ì‹œë¦¬ì¦ˆê°ì²´.index.name = name
    - ì‹œë¦¬ì¦ˆ í”„ë ˆì„ ê°’ í™•ì¸ 
        - ì‹œë¦¬ì¦ˆê°ì²´.values
        - ì‹œë¦¬ì¦ˆê°ì²´.index : ì¸ë±ìŠ¤ ì„ì˜ ëª…ëª… ê°€ëŠ¥
        - ì‹œë¦¬ì¦ˆê°ì²´.dtypes
    - ì‹œë¦¬ì¦ˆ ì¸ë±ìŠ¤ ì ‘ê·¼ 
        - Series ê°ì²´[ idx ] 
        - Series ê°ì²´[[ idx1, idx2, idx4 ]]  < ì´ì°¨ì› ë°°ì—´ >
    - ë”•ì…”ë„ˆë¦¬ë¥¼ ì´ìš©í•œ ì‹œë¦¬ì¦ˆ ìƒì„± 
        - pd.Series(Dict) 
    - ì‹œë¦¬ì¦ˆ ê°’ë“¤ì˜ ê°¯ìˆ˜ 
        - 
- DataFrame
    - ìƒì„±
        - (1) ë”•ì…”ë„ˆë¦¬ = ( í‚¤1 : ë°¸ë¥˜1, í‚¤2 : ë°¸ë¥˜2 ... ) í˜•íƒœ  
            - data = dict(í‚¤1 : [values1], í‚¤2 : [values2] .....)
            - df = pd.DataFrame(data)
        - (2) ë”•ì…”ë„ˆë¦¬ = { KEY1 : {key:val,key:val..}, KEY2 : {key:val.}} í˜•íƒœ(nested dictionary)
    - ì‚­ì œ
        - í•œê°œì˜ ì»¬ëŸ¼ ì‚­ì œ
            - del ë°ì´í„°í”„ë ˆì„[ì»¬ëŸ¼ëª…]
        - ì—¬ëŸ¬ê°œì˜ ì»¬ëŸ¼/í–‰ ì‚­ì œ
             - í–‰ ì‚­ì œ: DataFrameê°ì²´.drop(í–‰ ì¸ë±ìŠ¤ ë˜ëŠ” ë°°ì—´, axis=0, inplace = True/False) 
             - ì—´ ì‚­ì œ: DataFrameê°ì²´.drop(ì—´ ì´ë¦„ ë˜ëŠ” ë°°ì—´, axis=1, inplace = True/False)
                 - ì—¬ëŸ¬ ì—´ ì‚­ì œ ì‹œ : drop( \[ ì—´ ì´ë¦„ë“¤ \], axis = 0, inplace = True/False )
                - axis : 1 = ì—´, 0 = í–‰ 
                - inplace : True = ì›ë³¸ ê°ì²´ë¥¼ ì´ìš©, False = ë³µì‚¬ë³¸ ì´ìš© 
    - ì»¬ëŸ¼ëª…, ì¸ë±ìŠ¤ëª… ì„¤ì •
~~~python
pd.DataFrame(data, 
    columns = ['pop', 'year', 'state'], 
    index = ['one', 'two', 'three', 'forw', 'five'])
~~~
    - ë°ì´í„°í”„ë ˆì„ ê°’ í™•ì¸
        - df.index   : í–‰ ë°©í–¥ì˜ ì¸ë±ìŠ¤ í™•ì¸
        - df.columns : ì—´ ë°©í–¥ ì¸ë±ìŠ¤
        - df.values  : ê°’ í™•ì¸ => í–‰ ìˆœì„œëŒ€ë¡œ ì¶”ì¶œì´ ë¨ 
        - df['column_name']
- ë°ì´í„°í”„ë ˆì„ ì¸ë±ì‹± 
    - ê²°ì¸¡ì¹˜ ë‹¤ë£¨ê¸° 
- ë°ì´í„°í”„ë ˆì„ ë‹¤ë£¨ê¸°

# 1. Series 
- 1ì°¨ì› ë°°ì—´ì˜ ë°ì´í„°(NumPy ë°ì´í„° íƒ€ì…) 
- ì¸ë±ìŠ¤ = ë¼ë²¨, ê° ë°ì´í„°ì˜ ì¸ë±ìŠ¤ ë¼ë²¨ë§ ê°€ëŠ¥

## 1.1 Series ìƒì„± : pd.Series(np.array)

In [44]:
series1 = pd.Series([4, 7, -5, 3])
series1

0    4
1    7
2   -5
3    3
dtype: int64

## 1.2. ì‹œë¦¬ì¦ˆ ìƒì„± : pd.Series(dict) 
- ì¸ë±ìŠ¤ : ë”•ì…”ë„ˆë¦¬ì˜ í‚¤
- ê°’ : ë”•ì…”ë„ˆë¦¬ì˜ ê°’ 
- ì¸ë±ìŠ¤ ìˆœì„œ : ë”•ì…”ë„ˆë¦¬ì˜ ì¸ë±ìŠ¤ ìˆœìœ¼ë¡œ ì €ì¥

In [45]:
sdata = {'Ohio' : 35000, 
         'Texas' : 71000, 
         'Oregon' : 16000, 
         'Utah': 5000}
series8 = pd.Series(sdata)
series8

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

### 1.2.1 Seriesì™€ ì¸ë±ìŠ¤
- pd.Series(ë°ì´í„°, í‚¤)
    - ë°ì´í„°ì˜ ì¸ë±ìŠ¤ì™€ í‚¤ì˜ ê°’ ì¤‘ ë§¤ì¹­ë˜ëŠ” ê²ƒì´ ì—†ì„ ê²½ìš° ê°’ = NaN
- Ohio, Texas, Utahì— ëŒ€í•œ ê°’ì´ statesì™€ ë§¤ì¹­ë¨ 
- ê¸°ì¡´ ì‹œë¦¬ì¦ˆì™€ ê´€ë ¨ì—†ì´, ê° í‚¤-statesì™€ ë§¤ì¹­ë˜ëŠ” valueë“¤ì´ ë‚˜ì˜´

In [46]:
series8

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

###### pd.Series(ë°ì´í„°, í‚¤) 
- Coloradoì˜ ê°’ , ê¸°ì¡´ì˜ í‚¤ì™€ ë§¤ì¹­ëœëŠ ê²ƒì´ ì—†ìŒ â¤ NaN

In [8]:
states = {'Colorado', 'Ohio',  'Texas', 'Utah'}
series8 = pd.Series(sdata, states)
series8

Texas       71000.0
Colorado        NaN
Ohio        35000.0
Utah         5000.0
dtype: float64

## 1.3. ì¸ë±ìŠ¤ ëª…ëª… : 
- pd.Series([ ê°’ ë°°ì—´], index=[ì¸ë±ìŠ¤ ë°°ì—´])
- ì‹œë¦¬ì¦ˆê°ì²´.index = [ì¸ë±ìŠ¤ ì´ë¦„] 
- ì¸ë±ìŠ¤ : ë¬¸ìì—´, ë‚ ì§œ, ì‹œê°„ ë“±ë„ ì˜¬ ìˆ˜ ìˆìŒ

In [9]:
series2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
series2

d    4
b    7
a   -5
c    3
dtype: int64

###### ì¸ë±ìŠ¤ ì¬ë¼ë²¨ë§

In [10]:
series2.index = ['ğŸ˜','ğŸ¤—','ğŸ˜…','ğŸ˜']
series2

ğŸ˜    4
ğŸ¤—    7
ğŸ˜…   -5
ğŸ˜    3
dtype: int64

## 1.3. ì‹œë¦¬ì¦ˆ ê°ì²´,  ì‹œë¦¬ì¦ˆ ì¸ë±ìŠ¤ ëª…ëª…

#### ì‹œë¦¬ì¦ˆ ê°ì²´  / ì¸ë±ìŠ¤ ì´ë¦„ ì§€ì • ê°€ëŠ¥

In [11]:
series2.name = 'Practice'
series2.index.name = 'ğŸ¤—'
# obj.value.name = 'values'
series2

ğŸ¤—
ğŸ˜    4
ğŸ¤—    7
ğŸ˜…   -5
ğŸ˜    3
Name: Practice, dtype: int64

## 1.4. Series.values, Series.index, Series.dtypes 
- ì‹œë¦¬ì¦ˆ value, index, dtype í™•ì¸

In [12]:
series2

ğŸ¤—
ğŸ˜    4
ğŸ¤—    7
ğŸ˜…   -5
ğŸ˜    3
Name: Practice, dtype: int64

In [13]:
print(series2.values)
print(series2.index)
print(series2.dtypes)

[ 4  7 -5  3]
Index(['ğŸ˜', 'ğŸ¤—', 'ğŸ˜…', 'ğŸ˜'], dtype='object', name='ğŸ¤—')
int64

## 1.5. ì¸ë±ìŠ¤ë¥¼ ì´ìš©í•œ ì‹œë¦¬ì¦ˆ value ì ‘ê·¼ 
- Series ê°ì²´[ idx ] 
- Series ê°ì²´[[ idx1, idx2, idx4 ]] 
    - ì‹œë¦¬ì¦ˆì˜ ì—¬ëŸ¬ê°œì˜ ê°’ ì„ íƒí•´ì„œ ë³´ê¸° : ì´ì¤‘ ë°°ì—´ 
- Series ê°ì²´[start : end]

In [14]:
series3 = pd.Series([1,2,3,4], index=['a','b','c','d'])
print(series3)
series3[['a', 'b', 'c']]

a    1
b    2
c    3
d    4
dtype: int64

a    1
b    2
c    3
dtype: int64

###### 1) ì‹œë¦¬ì¦ˆê°ì²´['ì¸ë±ìŠ¤ ì´ë¦„']

In [15]:
series3['a']

1

###### 2) ì‹œë¦¬ì¦ˆê°ì²´[ì¸ë±ìŠ¤ ë²ˆí˜¸]

In [16]:
series3[0]

1

###### 3) ì‹œë¦¬ì¦ˆê°ì²´[ì‹œì‘ : ë]

In [17]:
series3[1:3]

b    2
c    3
dtype: int64

## 1.6. ì‹œë¦¬ì¦ˆ ê°„ì˜ ì—°ì‚° 
- NumPyì˜ ì—°ì‚°ë“¤ì„ í†µí•œ ì—°ì‚°(Filtering, Boolean Masking, Scalar Multiplication) ë“±ì˜ ì—°ì‚°ì„ í•˜ë”ë¼ë„ ' ì¸ë±ìŠ¤(ë¼ë²¨)-ê°’ 'ì€ ìœ ì§€ê°€ ë¨

In [18]:
series4 = pd.Series([1,2,3,4], index=['a','b','c','d'])
series4

a    1
b    2
c    3
d    4
dtype: int64

### 1.6.a ì‹œë¦¬ì¦ˆ ì—°ì‚° ( ê°™ì€ ì¸ë±ìŠ¤ ì‹œë¦¬ì¦ˆ * ê°™ì€ ì¸ë°ìŠ¤ ì‹œë¦¬ì¦ˆ )

In [19]:
series4 * series4

a     1
b     4
c     9
d    16
dtype: int64

### 1.6.b ì‹œë¦¬ì¦ˆ ì—°ì‚° ( ê°™ì€ ì¸ë±ìŠ¤ ì‹œë¦¬ì¦ˆ * ë‹¤ë¥¸ ì¸ë±ìŠ¤ ì‹œë¦¬ì¦ˆ )
- indexê°€ ë§ëŠ ì•Šì„ ê²½ìš°, ì—°ì‚° ê²°ê³¼ì—ì„œ ì„œë¡œ ë‹¤ë¥¸ indexëŠ” NaNê°’ì´ ë“¤ì–´ê°

In [20]:
series5 = pd.Series([1,2,3,4], index = ['a', 'b', 'c', 'DDDDDDDD'])
series6 = pd.Series([10,20,30], index = ['a', 'b', 'FFFFFFFF'])

print(series5, series6, sep='\n\n')
print('____________________')
series5 * series6

a           1
b           2
c           3
DDDDDDDD    4
dtype: int64

a           10
b           20
FFFFFFFF    30
dtype: int64
____________________

DDDDDDDD     NaN
FFFFFFFF     NaN
a           10.0
b           40.0
c            NaN
dtype: float64

## 1.7. í‚¤ in Series ì—°ì‚°

In [21]:
series7 = pd.Series([1,2,3,4], index = ['a', 'b', 'c', 'DDDDDDDD'])
series7

a           1
b           2
c           3
DDDDDDDD    4
dtype: int64

In [22]:
'b' in series7

True

In [23]:
2 in series7

False

# 2. ë°ì´í„°í”„ë ˆì„ 
- ê³µí†µ ì¸ë±ìŠ¤
- í•˜ë‚˜ì˜ ì—´ì´ ë˜ëŠ” ë°ì´í„°ë¥¼ ë¦¬ìŠ¤íŠ¸/ ì¼ì°¨ì› ë°°ì—´ ì¤€ë¹„
ê° ì—´ì— ëŒ€í•œ ì´ë¦„(label)ê³¼ í‚¤ë¥¼ ê°–ëŠ” ë”•ì…”ë„ˆë¦¬ ìƒì„±
Pandas ì˜ DataFrame í´ë˜ìŠ¤ë¡œ ìƒì„±
ì—´ë°©í–¥ ì¸ë±ìŠ¤ëŠ” Columnsì¸ìˆ˜ë¡œ í–‰ë°©í–¥ ì¸ë±ìŠ¤ëŠ” indexì¸ìˆ˜ë¡œ ì§€ì •

## 2.1. ë°ì´í„°í”„ë ˆì„ ìƒì„±(1) : pd.DataFrame( Dict )

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df1 = pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

## 2.2. ë°ì´í„°í”„ë ˆì„ ìƒì„±(2) : pd.DataFrame( JSON ë°ì´í„°, Nested Dict )

In [47]:
data = pop = {'Nevada': {2001: 2.4, 2002: 2.9},
            'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df2 = pd.DataFrame(data)
df2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

## 2.3. ë°ì´í„° í”„ë ˆì„, ì¸ë±ìŠ¤, ì»¬ëŸ¼ ëª…ëª…
- df.index.name = name 
- df.columns.name = name

In [50]:
data = pop = {'Nevada': {2001: 2.4, 2002: 2.9},
            'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df_name = pd.DataFrame(data)
df_name.index.name = 'Year'
df_name.columns.name = 'State'
df_name

State  Nevada  Ohio
Year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

## 2.4. ë°ì´í„°í”„ë ˆì„ ì—´ ì‚­ì œ : df.drop([columns...])
- drop(ë°ì´í„°í”„ë ˆì„[ì»¬ëŸ¼ëª…....], axis = 1 , inplace = True )
    - axis : 1 = ì—´, 0 = í–‰ 
    - inplace : True = ì›ë³¸ ê°ì²´ë¥¼ ì´ìš©, False = ë³µì‚¬ë³¸ ì´ìš© 
- del(ë°ì´í„°í”„ë ˆì„[ì»¬ëŸ¼ëª…])

In [51]:
data = pop = {'Nevada': {2001: 2.4, 2002: 2.9},
            'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6},
             'Utah': {2000: 1.5, 2001: 1.8, 2002: 4.1}}
df_extra = pd.DataFrame(data)
df_extra

      Nevada  Ohio  Utah
2001     2.4   1.7   1.8
2002     2.9   3.6   4.1
2000     NaN   1.5   1.5

In [52]:
df_extra.drop(['Nevada'], axis = 1, inplace = False)

      Ohio  Utah
2001   1.7   1.8
2002   3.6   4.1
2000   1.5   1.5

## 2.5. ë°ì´í„° í”„ë ˆì„ ì—´ ì¶”ê°€

In [53]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df3 = pd.DataFrame(data)
df3

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

######  ìƒˆë¡œìš´ ì»¬ëŸ¼ ì¶”ê°€ ( 1 ) : ê°™ì€ ë°ì´í„° íƒ€ì…ì„ ê°–ëŠ” ì—´ ê°„ì˜ ì—°ì‚°

In [28]:
df3['year+population'] = df1['year'] + df1['pop']
df3

    state  year  pop  year+population
0    Ohio  2000  1.5           2001.5
1    Ohio  2001  1.7           2002.7
2    Ohio  2002  3.6           2005.6
3  Nevada  2001  2.4           2003.4
4  Nevada  2002  2.9           2004.9

###### ìƒˆë¡œìš´ ì»¬ëŸ¼ ì¶”ê°€ (2) : ë‹¤ë¥¸ ë°ì´í„° íƒ€ì…ì„ ê°–ëŠ” ì—´ ê°„ì˜ ì—°ì‚°
- df[ìƒˆë¡œìš´ ì»¬ëŸ¼] = df.ì»¬ëŸ¼ë„¤ì„.astype(íƒ€ì…) + df.ì»¬ëŸ¼ë„¤ì„ 
- df[ìƒˆë¡œìš´ ì»¬ëŸ¼] = df[ì»¬ëŸ¼ì´ë¦„].astype(íƒ€ì…) + df[ì»¬ëŸ¼ë„¤ì„]

In [29]:
df3['nickname'] = df3['year'].astype(str) + df3['state']
df3

    state  year  pop  year+population    nickname
0    Ohio  2000  1.5           2001.5    2000Ohio
1    Ohio  2001  1.7           2002.7    2001Ohio
2    Ohio  2002  3.6           2005.6    2002Ohio
3  Nevada  2001  2.4           2003.4  2001Nevada
4  Nevada  2002  2.9           2004.9  2002Nevada

#### ìƒˆë¡œìš´ ì»¬ëŸ¼ ì¶”ê°€ (3) : í•˜ë‚˜ì˜ ì»¬ëŸ¼ì— ìŠ¤íŠ¸ë§/ìˆ«ì ë“± ì¶”ê°€
- df[ì»¬ëŸ¼].astype(type) : í•´ë‹¹ ì—´ì˜ íƒ€ì…ì„ ë‹¤ë¥¸ íƒ€ì…ìœ¼ë¡œ ë³€ê²½

In [30]:
df3['test_column'] = df3['pop'].astype(str) + 'ë§Œ ëª…'
df3

    state  year  pop  year+population    nickname test_column
0    Ohio  2000  1.5           2001.5    2000Ohio      1.5ë§Œ ëª…
1    Ohio  2001  1.7           2002.7    2001Ohio      1.7ë§Œ ëª…
2    Ohio  2002  3.6           2005.6    2002Ohio      3.6ë§Œ ëª…
3  Nevada  2001  2.4           2003.4  2001Nevada      2.4ë§Œ ëª…
4  Nevada  2002  2.9           2004.9  2002Nevada      2.9ë§Œ ëª…

In [31]:
df3.drop(['year+population', 'nickname', 'test_column'], 
         axis = 1, 
         inplace = True)
df3

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

## 2.6. ë°ì´í„° í”„ë ˆì„ ì»¬ëŸ¼ ìˆœì„œ ì •í•˜ê¸°
- pd.DataFrame(ë°ì´í„°, ì»¬ëŸ¼ = [ c1, c2, c3 ] )

In [54]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df4 = pd.DataFrame(data)
df4

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

###### ë°ì´í„° ì»¬ëŸ¼ ìˆœì„œ ë³€ê²½

In [55]:
df5 = pd.DataFrame(data, columns = ['pop', 'year', 'state'])
df5

   pop  year   state
0  1.5  2000    Ohio
1  1.7  2001    Ohio
2  3.6  2002    Ohio
3  2.4  2001  Nevada
4  2.9  2002  Nevada

## 2.6. ë°ì´í„° í”„ë ˆì„ ì¸ë±ìŠ¤ ì´ë¦„ ë„£ê¸°
- ì¸ë±ìŠ¤ì˜ ê¸¸ì´ì™€ í–‰ì˜ ê¸¸ì´ê°€ ê°™ì§€ ì•Šìœ¼ë©´ ì—ëŸ¬

In [34]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df6 = pd.DataFrame(data, 
                  columns = ['pop', 'year', 'state'], 
                  index = ['one', 'two', 'three', 'forw', 'five'])

df6

       pop  year   state
one    1.5  2000    Ohio
two    1.7  2001    Ohio
three  3.6  2002    Ohio
forw   2.4  2001  Nevada
five   2.9  2002  Nevada

#### dataì— ì—†ëŠ” ì»¬ëŸ¼ì„ ì „ë‹¬í•  ê²½ìš°, í•´ë‹¹ ì»¬ëŸ¼ : NaN

In [35]:
df7 = pd.DataFrame(data, columns = ['pop', 'year', 'state', 'ğŸ˜'])
df7

   pop  year   state    ğŸ˜
0  1.5  2000    Ohio  NaN
1  1.7  2001    Ohio  NaN
2  3.6  2002    Ohio  NaN
3  2.4  2001  Nevada  NaN
4  2.9  2002  Nevada  NaN

## 2.7. ë°ì´í„°í”„ë ˆì„ ì¸ë±ìŠ¤, ì—´, í–‰ ê°’ í™•ì¸
- df.index   : í–‰ ë°©í–¥ì˜ ì¸ë±ìŠ¤ í™•ì¸
- df.columns : ì—´ ë°©í–¥ ì¸ë±ìŠ¤
- df.values  : ê°’ í™•ì¸ => í–‰ ìˆœì„œëŒ€ë¡œ ì¶”ì¶œì´ ë¨ 
- df['column_name']

In [36]:
df8 = pd.DataFrame(data)
df8

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

###### ì¸ë±ìŠ¤ ê°¯ìˆ˜ í™•ì¸

In [37]:
df8.index

RangeIndex(start=0, stop=5, step=1)

###### ì—´ í™•ì¸

In [38]:
df8.columns

Index(['state', 'year', 'pop'], dtype='object')

###### ê° íŠœí”Œ ê°’ í™•ì¸

In [39]:
df8.values

array([['Ohio', 2000, 1.5],
       ['Ohio', 2001, 1.7],
       ['Ohio', 2002, 3.6],
       ['Nevada', 2001, 2.4],
       ['Nevada', 2002, 2.9]], dtype=object)

## 2.8. ë°ì´í„° í”„ë ˆì„ ì»¬ëŸ¼ ì¶”ì¶œ : __ê° ë°ì´í„° í”„ë ˆì„ì˜ ì»¬ëŸ¼ì€ í•˜ë‚˜ì˜ ì‹œë¦¬ì¦ˆ__
- df['column_name']

In [40]:
print( df8['state'] )
print('----------------------------')
print( type(df8['state']) )  # Series íƒ€ì…

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object
----------------------------
<class 'pandas.core.series.Series'>

## 2.9. ë°ì´í„°í”„ë ˆì„ ì»¬ëŸ¼ ìˆ˜ì • ( ë°ì´í„°í”„ë ˆì„ * Scalar/Vector ) 
- ë°ì´í„°í”„ë ˆì„[ì»¬ëŸ¼ëª…] = ìŠ¤ì¹¼ë¼ 
- ë°ì´í„°í”„ë ˆì„[ì»¬ëŸ¼ëª…] = ë°°ì—´
    - ë°°ì—´ì˜ ê¸¸ì´ì™€ ì»¬ëŸ¼ì˜ ê¸¸ì´ëŠ” ê°™ì•„ì•¼ í•¨

In [41]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df10 = pd.DataFrame(data)
df10

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

###### Scalar

In [42]:
df10['pop'] = 10
df10

    state  year  pop
0    Ohio  2000   10
1    Ohio  2001   10
2    Ohio  2002   10
3  Nevada  2001   10
4  Nevada  2002   10

###### vector

In [43]:
df10['pop'] = np.arange(5)
df10

    state  year  pop
0    Ohio  2000    0
1    Ohio  2001    1
2    Ohio  2002    2
3  Nevada  2001    3
4  Nevada  2002    4

# 3. ë°ì´í„°í”„ë ˆì„ ì¸ë±ì‹±
- 1ì°¨ì› ì¸ë±ì‹± ( ë‹¨ì¼ ì»¬ëŸ¼, ë‹¨ì¼ í–‰ )
    - Column ì¸ë±ì‹±  : df['year] , df.year
    - Row ì¸ë±ì‹± : df[start : end]
- 2ì°¨ì› ì¸ë±ì‹± ( ë‹¤ì¤‘ ì»¬ëŸ¼, ë‹¤ì¤‘ í–‰ )
    - loc ì¸ë±ì‹± : ë¼ë²¨ê°’ ê¸°ì¤€ ì¸ë±ì‹±

In [61]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df11 = pd.DataFrame(data)
df11

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

## 3.1. Column ì¸ë±ì‹±  : df['year] , df.year

In [60]:
df11['year']

0    2000
1    2001
2    2002
3    2001
4    2002
Name: year, dtype: int64

## 3.2. í–‰ ë‹¨ìœ„ ì¸ë±ì‹± : df[ first_index : end_index ]

###### ì •ìˆ˜ ìŠ¬ë¼ì´ì‹± ì¸ë±ì‹±

In [85]:
df11[0:2]

    state  year  pop
one  Ohio  2000  1.5
two  Ohio  2001  1.7

In [86]:
df11.index = ['one', 'two', 'three', 'four', 'five']
df11

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9

###### ì¸ë±ì‹± ì´ë¦„ìœ¼ë¡œ ìŠ¬ë¼ì´ì‹±

In [87]:
df11['two':'four']

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4

## 3.3. loc ì¸ë±ì‹± : ì¸ë±ìŠ¤ ê¸°ë°˜ ì¸ë±ì‹± 
- df.loc[ìŠ¬ë¼ì´ìŠ¤ ê°ì²´]
- df.loc[í–‰, ì»¬ëŸ¼]
- df.loc[í–‰, [ì»¬ëŸ¼ë“¤]]
- df.loc[í–‰(ìŠ¬ë¼ì´ìŠ¤)] [ ì»¬ëŸ¼ ]
- df.loc[í–‰(ìŠ¬ë¼ì´ìŠ¤)] [[ ì»¬ëŸ¼ë“¤ ]]
___
- loc  : ì¸ë±ìŠ¤ë§Œ ì‚¬ìš© ê°€ëŠ¥ 
- iloc : ì •ìˆ˜ë¡œë§Œ ì¸ë±ì‹±  
___
- cf)
    -> 1ê°œ ì‹œë¦¬ì¦ˆ, 2ê°œ ë°ì´í„°í”„ë ˆì„ 
    - 2ê°œ ì´ìƒ ì„ íƒ ì‹œì—ëŠ” ëŒ€ê´„í˜¸ 2ê°œ 
    - ìŠ¬ë¼ì´ì‹± ê°ì²´ëŠ” 1ê°œì˜ ì¸ë±ìŠ¤ë¡œ

###### df.loc[í–‰ ì¸ë±ìŠ¤]

In [120]:
df11.loc['two']   # ì‹œë¦¬ì¦ˆ ë°˜í™˜ -> ëŒ€ê´„í˜¸ 1ê°œ

state    Ohio
year     2001
pop       1.7
Name: two, dtype: object

In [108]:
df11.loc[['two']] # ë°ì´í„°í”„ë ˆì„ ë°˜í™˜ -> ëŒ€ê´„í˜¸ 2ê°œ

    state  year  pop
two  Ohio  2001  1.7

###### df.loc[ìŠ¬ë¼ì´ìŠ¤ ê°ì²´]
- ìŠ¬ë¼ì´ìŠ¤ ê°ì²´ ì‚¬ìš© ì‹œ, í•˜ë‚˜ì˜ ë²”ìœ„ = í•˜ë‚˜ì˜ ì¸ë±ìŠ¤ì™€ ê°™ì´ ìƒê°

In [134]:
df11.loc["two":"four"]

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4

###### df.loc[ : , ì»¬ëŸ¼ ì´ë¦„] -> ì‹œë¦¬ì¦ˆ ë°˜í™˜

In [141]:
df11.loc[:,'state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

###### df.loc[í–‰, [ì—´,....]] -> ë°ì´í„°í”„ë ˆì„

In [145]:
df11.loc[:,['state']]

        state
one      Ohio
two      Ohio
three    Ohio
four   Nevada
five   Nevada

In [146]:
df11.loc[['two', 'four', 'five']]

       state  year  pop
two     Ohio  2001  1.7
four  Nevada  2001  2.4
five  Nevada  2002  2.9

In [149]:
df11.loc['two':'five', ['state']]

        state
two      Ohio
three    Ohio
four   Nevada
five   Nevada

In [154]:
df11.loc['two':'five',:]

        state  year  pop
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9

### 3.3.1 í–‰ ì„ íƒ, ì—´ì„ íƒ 
- def.loc[í–‰ ì¸ë±ìŠ¤] [ ì—´ ì¸ë±ìŠ¤ / ì—´ ì¸ë±ìŠ¤ ìŠ¬ë¼ì´ìŠ¤ ] 
    - ì„ íƒí•œ í–‰ ì¸ë±ìŠ¤ì— ëŒ€í•´ ì—´ ì¸ë±ìŠ¤ì— ëŒ€í•œ ì‹œë¦¬ì¦ˆ ë°˜í™˜ : ëŒ€ê´„í˜¸ 1ê°œ
        - __ëŒ€ê´„í˜¸ 1ê°œ ì‚¬ìš©ì‹œ, ì—´ ì¸ë±ìŠ¤ 1ê°œ ì‚¬ìš© â¤ ì‹œë¦¬ì¦ˆê°€ ë°˜í™˜ ê°ì²´ !__
- def.loc[í–‰ ì¸ë±ìŠ¤] [[ ì—´ ì¸ë±ìŠ¤ / ì—´ ì¸ë±ìŠ¤ ìŠ¬ë¼ì´ìŠ¤ ]] 
    - ì„ íƒí•œ í–‰ ì¸ë±ìŠ¤ì— ëŒ€í•´ ì—´ ì¸ë±ìŠ¤ì— ëŒ€í•œ ë°ì´í„°í”„ë ˆì„ ë°˜í™˜ : ëŒ€ê´„í˜¸ 2ê°œ

In [118]:
df11.loc['two':'four']['state']

two        Ohio
three      Ohio
four     Nevada
Name: state, dtype: object

###### loc[í–‰, discrete columns]  ( 1 )

In [116]:
df11.loc['two':'four'][['state', 'pop']]

        state  pop
two      Ohio  1.7
three    Ohio  3.6
four   Nevada  2.4

###### loc[í–‰, discrete columns]  ( 2 )

In [157]:
df11.loc['two':'four', ['state', 'pop']]

        state  pop
two      Ohio  1.7
three    Ohio  3.6
four   Nevada  2.4

In [155]:
df11.loc['two':'four']['state', 'pop'] # Error, ì—´ ì—¬ëŸ¬ê°œ ì„ íƒ, ëŒ€ê´„í˜¸ 1ê°œ ì‚¬ìš©

KeyError: ('state', 'pop')

## 3.4. iloc ì¸ë±ì‹± 
- ì •ìˆ˜ ê¸°ë°˜ ì¸ë±ì‹± 
- df.iloc[í–‰ ì¸ë±ìŠ¤][[ ì»¬ëŸ¼ ì´ë¦„ ì¸ë±ìŠ¤ ]] 
- df.iloc[í–‰ ì¸ë±ìŠ¤][[ ìˆ«ì ì¸ë±ìŠ¤ ]] â¤ ì—ëŸ¬ 
    - iloc ë°–ì—ì„œ ì •ìˆ˜ ê¸°ë°˜ ì¸ë±ìŠ¤ ì²˜ë¦¬ ì‹œ ì—ëŸ¬

In [187]:
data = {'state': ['Ohio', 'Michigan', 'Utah', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df12 = pd.DataFrame(data, index = ['one', 'two', 'three', 'four', 'five'])
df12

          state  year  pop
one        Ohio  2000  1.5
two    Michigan  2001  1.7
three      Utah  2002  3.6
four     Nevada  2001  2.4
five     Nevada  2002  2.9

In [188]:
df12.iloc[0:2]

        state  year  pop
one      Ohio  2000  1.5
two  Michigan  2001  1.7

In [189]:
df12.iloc[:, 0:3]

          state  year  pop
one        Ohio  2000  1.5
two    Michigan  2001  1.7
three      Utah  2002  3.6
four     Nevada  2001  2.4
five     Nevada  2002  2.9

In [164]:
df12.iloc[:, [0,2]]

        state  pop
one      Ohio  1.5
two      Ohio  1.7
three    Ohio  3.6
four   Nevada  2.4
five   Nevada  2.9

In [168]:
df12.loc['one']['state']

'Ohio'

In [169]:
df12.iloc[0][0]

'Ohio'

In [173]:
df12.iloc[0:2, [0,1]]

    state  year
one  Ohio  2000
two  Ohio  2001

In [177]:
df12.iloc[0:2][['state', 'year']]

    state  year
one  Ohio  2000
two  Ohio  2001

In [174]:
df12.iloc[0:2][[0,1]] # Error

KeyError: "None of [Int64Index([0, 1], dtype='int64')] are in the [columns]"

## 3.5. ì¸ë±ì‹±ì„ í†µí•œ ê°’ ìˆ˜ì •

In [184]:
data = {'state': ['Ohio', 'Michigan', 'Utah', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df13 = pd.DataFrame(data, index = ['one', 'two', 'three', 'four', 'five'])
df13

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9

In [185]:
df13.iloc[0:2, 0] = 'Colorad', 'Michigan'
df13

          state  year  pop
one     Colorad  2000  1.5
two    Michigan  2001  1.7
three      Ohio  2002  3.6
four     Nevada  2001  2.4
five     Nevada  2002  2.9

## 3.6. Boolean ì¸ë±ì‹±

In [192]:
data = {'state': ['Ohio', 'Michigan', 'Utah', 'New York', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df14 = pd.DataFrame(data, index = ['one', 'two', 'three', 'four', 'five'])
df14

          state  year  pop
one        Ohio  2000  1.5
two    Michigan  2001  1.7
three      Utah  2002  3.6
four   New York  2001  2.4
five     Nevada  2002  2.9

######  Series ê°ì²´ ê°€ì ¸ì˜¤ê¸°

In [223]:
df14['year'] == 2001

one      False
two       True
three    False
four      True
five     False
Name: year, dtype: bool

###### df.loc[ì‹œë¦¬ì¦ˆ ê°ì²´] ( 1 )

In [224]:
df14.loc[
    pd.Series([False,True,False,True,False], 
              index=['one','two','three', 'four', 'five'])
]

         state  year  pop
two   Michigan  2001  1.7
four  New York  2001  2.4

###### df.loc[ì‹œë¦¬ì¦ˆ ê°ì²´] ( 2 )

In [225]:
df14.loc[df14['year'] == 2001]

         state  year  pop
two   Michigan  2001  1.7
four  New York  2001  2.4

###### boolean indexing

In [229]:
boolean_idx = df14['year'] == 2001
boolean_idx

one      False
two       True
three    False
four      True
five     False
Name: year, dtype: bool

In [230]:
df14.loc[boolean_idx, ['state', 'pop']]

         state  pop
two   Michigan  1.7
four  New York  2.4

In [231]:
df14.loc[boolean_idx][['state', 'pop']]

         state  pop
two   Michigan  1.7
four  New York  2.4

In [205]:
df14.loc[df14['year'] == 2001, ['state', 'pop']]

         state  pop
two   Michigan  1.7
four  New York  2.4

In [206]:
df14.loc[df14['year'] == 2001][['state', 'pop']]

         state  pop
two   Michigan  1.7
four  New York  2.4

In [211]:
df14.loc[df14['year'] == 2001][['state', 'pop']]

         state  pop
two   Michigan  1.7
four  New York  2.4

In [209]:
df14.loc[ ( df14['year'] > 2000 ) & ( df14['year'] < 2002 ) ]

         state  year  pop
two   Michigan  2001  1.7
four  New York  2001  2.4

In [235]:
iloc_practice = df14.iloc[:,1] > 2000
iloc_practice

one      False
two       True
three     True
four      True
five      True
Name: year, dtype: bool

In [238]:
df14.iloc[0:3, [0,1,2]]

          state  year  pop
one        Ohio  2000  1.5
two    Michigan  2001  1.7
three      Utah  2002  3.6

# 4. ë°ì´í„°í”„ë ˆì„ ë‹¤ë£¨ê¸°

In [5]:
import numpy as np
import pandas as pd

In [7]:
np.random.seed(0)
df15 = pd.DataFrame(np.random.randn(6,4))
df15

          0         1         2         3
0  1.764052  0.400157  0.978738  2.240893
1  1.867558 -0.977278  0.950088 -0.151357
2 -0.103219  0.410599  0.144044  1.454274
3  0.761038  0.121675  0.443863  0.333674
4  1.494079 -0.205158  0.313068 -0.854096
5 -2.552990  0.653619  0.864436 -0.742165

## 4.1. ì‹œê³„ì—´ ë°ì´í„° í”„ë ˆì„ ìƒì„± 
- pd.date_range('ì‹œì‘ ë‚ ì§œ', peridos)

In [15]:
df15.columns = 'A', 'B', 'C', 'D'
df15.index = pd.date_range('20160701', periods = 6)
print( type(pd.date_range('20160701', periods = 6)) )
df15

<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

                   A         B         C         D
2016-07-01  1.764052  0.400157  0.978738  2.240893
2016-07-02  1.867558 -0.977278  0.950088 -0.151357
2016-07-03 -0.103219  0.410599  0.144044  1.454274
2016-07-04  0.761038  0.121675  0.443863  0.333674
2016-07-05  1.494079 -0.205158  0.313068 -0.854096
2016-07-06 -2.552990  0.653619  0.864436 -0.742165

###### íŠ¹ì • ë‚ ì§œ í–‰ ì‚­ì œ : pd.drop(pd.to_datetime('íŠ¹ì •ë‚ ì§œ')

In [82]:
df15.drop(pd.to_datetime('20160701'))

                   A         B         C         D    F
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

###### ì—¬ëŸ¬ ë‚ ì§œ í–‰ ì‚­ì œ : pd.drop([pd.to_datetime('ë‚ ì§œ'), pd.to_datetime('ë‚ ì§œ')])

In [88]:
df15.drop([ pd.to_datetime('20160701'), pd.to_datetime('20160704') ])

                   A         B         C         D    F
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

## 4.2. ê²°ì¸¡ì¹˜ ë‹¤ë£¨ê¸° 
- dropna(how=' option ', inplace = Falase) 
    - inplace = Flase í•´ë‹¹ ë°ì´í„°í”„ë ˆì„ì— ëŒ€í•œ â€Ÿ__ë³µì‚¬ë³¸__â€ì„ ë°˜í™˜ 
    - inplace = True  í•´ë‹¹ ë°ì´í„°í”„ë ˆì„ì„ ì§ì ‘ ìˆ˜ì • 
- df.fillna(ê°’)
- df.isnull()
- df.isna()

### 4.2.1. ê²°ì¸¡ì¹˜ ë°ì´í„° ì‚­ì œí•˜ê¸° 
- df.dropna(how = ' option ' , axis = í–‰(0)/ì—´(1) ) # default : 0
- axis = 1 : ì—´

###### a. ê²°ì¸¡ê°’ì„ ê°–ëŠ” ì»¬ëŸ¼ ì¶”ê°€

In [19]:
df15['F'] = [ 1.0, np.nan, 3.5, 6.1, np.nan, 7.0]

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

###### b. ë°ì´í„°í”„ë ˆì„.dropna(how='any') : í–‰ì˜ ê°’ ì¤‘ í•˜ë‚˜ë¼ë„ NaNì¸ ê²½ìš° í–‰ ë¹¼ê³  ë³´ì—¬ì¤Œ

In [36]:
df15.dropna(how='any')

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

In [37]:
df15

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

###### c. df15.dropna(how='all') : í–‰ì˜ ëª¨ë“  ê°’ì´ NaNì¸ ê²½ìš°, í•´ë‹¹ í–‰ ë¹¼ê³  ë³´ì—¬ì¤Œ

In [38]:
df15.dropna(how='all')

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

### 4.2.2. ê²°ì¸¡ì¹˜ ê°¯ìˆ˜ ë° í™•ì¸í•˜ê¸° 
- df.isnull() / df.isna()
    - ë°ì´í„°í”„ë ˆì„ì—ì„œ NaNì¸ ì…€ = True, ì•„ë‹Œ ê²½ìš° Falseë¥¼ ê°–ëŠ” ë°ì´í„°í”„ë ˆì„ ë°˜í™˜ 
- df.isnull().sum() 
- df.isna().sum()

In [74]:
df15.isnull()

                A      B      C      D      F
2016-07-01  False  False  False  False  False
2016-07-02  False  False  False  False   True
2016-07-03  False  False  False  False  False
2016-07-04  False  False  False  False  False
2016-07-05  False  False  False  False   True
2016-07-06  False  False  False  False  False

In [77]:
df15.isna()

                A      B      C      D      F
2016-07-01  False  False  False  False  False
2016-07-02  False  False  False  False   True
2016-07-03  False  False  False  False  False
2016-07-04  False  False  False  False  False
2016-07-05  False  False  False  False   True
2016-07-06  False  False  False  False  False

In [78]:
df15.isnull().sum()

A    0
B    0
C    0
D    0
F    2
dtype: int64

In [53]:
df15.isna().sum()

A    0
B    0
C    0
D    0
F    2
dtype: int64

### 4.2.3. ê²°ì¸¡ê°’ì„ ëŒ€ì²´ê°’ìœ¼ë¡œ ì±„ìš°ê¸°( imputation )

In [79]:
df15

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  NaN
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  NaN
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

###### íŠ¹ì •ê°’ìœ¼ë¡œ ì±„ìš°ê¸°  : df.fillna(ê°’)

In [59]:
df15.fillna(0.5)

                   A         B         C         D    F
2016-07-01  1.764052  0.400157  0.978738  2.240893  1.0
2016-07-02  1.867558 -0.977278  0.950088 -0.151357  0.5
2016-07-03 -0.103219  0.410599  0.144044  1.454274  3.5
2016-07-04  0.761038  0.121675  0.443863  0.333674  6.1
2016-07-05  1.494079 -0.205158  0.313068 -0.854096  0.5
2016-07-06 -2.552990  0.653619  0.864436 -0.742165  7.0

###### í•´ë‹¹ ì»¬ëŸ¼ì˜ ìœ ì¼í•œ ê°’ë“¤ë§Œ ê°€ì ¸ì˜¤ê¸°

In [89]:
df15['F'].unique()

array([1. , nan, 3.5, 6.1, 7. ])

###### ê²°ì¸¡ê°’ ëŒ€ì‹ , í‰ê· ê°’(ë¶„ì‚°, í‘œì¤€í¸ì°¨ ë“±..)ì„ ëŒ€ì‹  ë„£ê¸°

In [90]:
df15['F'].fillna(df15.F.mean())
df15['F'].fillna(df15.F.median())

2016-07-01    1.0
2016-07-02    4.8
2016-07-03    3.5
2016-07-04    6.1
2016-07-05    4.8
2016-07-06    7.0
Freq: D, Name: F, dtype: float64

# 5. ë°ì´í„° ì²˜ë¦¬í•˜ê¸°

## 5.1. ë°ì´í„° ë¶ˆëŸ¬ì˜¤ê¸°

### pd.read_íŒŒì¼í˜•ì‹( ê²½ë¡œ, index_col=ì»¬ëŸ¼ëª…/ì»¬ëŸ¼ì¸ë±ìŠ¤) )
- pd.read_csv(ê²½ë¡œ)
- pd.read_excel(ê²½ë¡œ)

In [99]:
df_csv = pd.read_csv('./ë³´ì¶©ìë£Œ/Pandas/data/read_csv_sample.csv')
df_csv

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [124]:
df_excel = pd.read_excel('./ë³´ì¶©ìë£Œ/Pandas/data/stock price.xlsx')
df_excel

       id stock_name          value   price
0  128940       í•œë¯¸ì•½í’ˆ   59385.666667  421000
1  130960     CJ E&M   58540.666667   98900
2  138250      ì—”ì—ìŠ¤ì‡¼í•‘   14558.666667   13200
3  139480        ì´ë§ˆíŠ¸  239230.833333  254500
4  142280     ë…¹ì‹­ìì— ì—ìŠ¤     468.833333   10200
5  145990        ì‚¼ì–‘ì‚¬   82750.000000   82000
6  185750        ì¢…ê·¼ë‹¹   40293.666667  100500
7  192400      ì¿ ì¿ í™€ë”©ìŠ¤  179204.666667  177500
8  199800         íˆ´ì     -2514.333333  115400
9  204210     ëª¨ë‘íˆ¬ì–´ë¦¬ì¸     3093.333333    3475

######  read_íŒŒì¼í˜•ì‹( ê²½ë¡œ, ì˜µì…˜1, ì˜µì…˜2 ... )

<img src="./images/read_íŒŒì¼_ì˜µì…˜1.jpg" height = "70%" width = "70%" align = "left" >

<img src="./images/read_íŒŒì¼_ì˜µì…˜2.jpg" height = "70%" width = "70%" align = "left" >

## 5.2 ë°ì´í„° ì“°ê¸° ( ë°ì´í„°í”„ë ˆì„.to_íŒŒì¼í˜•ì‹( ì €ì¥ê²½ë¡œ )  )
- í—¤ë”ë¥¼ ì¡°ì ˆí•´ì¤˜ì•¼ë¨

In [125]:
df_excel.to_csv('./data.csv')

In [126]:
df_csv = pd.read_csv('./data.csv')

In [127]:
df_csv

   Unnamed: 0      id stock_name          value   price
0           0  128940       í•œë¯¸ì•½í’ˆ   59385.666667  421000
1           1  130960     CJ E&M   58540.666667   98900
2           2  138250      ì—”ì—ìŠ¤ì‡¼í•‘   14558.666667   13200
3           3  139480        ì´ë§ˆíŠ¸  239230.833333  254500
4           4  142280     ë…¹ì‹­ìì— ì—ìŠ¤     468.833333   10200
5           5  145990        ì‚¼ì–‘ì‚¬   82750.000000   82000
6           6  185750        ì¢…ê·¼ë‹¹   40293.666667  100500
7           7  192400      ì¿ ì¿ í™€ë”©ìŠ¤  179204.666667  177500
8           8  199800         íˆ´ì     -2514.333333  115400
9           9  204210     ëª¨ë‘íˆ¬ì–´ë¦¬ì¸     3093.333333    3475

## 5.3 ë°ì´í„° ë¶ˆëŸ¬ì„œ ë°ì´í„° í™•ì¸í•˜ê¸°

In [11]:
titanic = pd.read_excel("http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.xls")

In [12]:
titanic.head(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [13]:
titanic.tail(10)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1299,3,0,"Yasbeck, Mr. Antoni",male,27.0,1,0,2659,14.4542,NaN,C,C,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [140]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

###### ê²°ì¸¡ì¹˜ í™•ì¸

In [142]:
titanic.isnull().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

###### ê²°ì¸¡ì¹˜ ì²˜ë¦¬

In [147]:
titanic['age'].value_counts()

24.0000    47
22.0000    43
21.0000    41
30.0000    40
18.0000    39
           ..
26.5000     1
67.0000     1
70.5000     1
76.0000     1
0.6667      1
Name: age, Length: 98, dtype: int64

In [150]:
titanic['age'].unique()

array([29.    ,  0.9167,  2.    , 30.    , 25.    , 48.    , 63.    ,
       39.    , 53.    , 71.    , 47.    , 18.    , 24.    , 26.    ,
       80.    ,     nan, 50.    , 32.    , 36.    , 37.    , 42.    ,
       19.    , 35.    , 28.    , 45.    , 40.    , 58.    , 22.    ,
       41.    , 44.    , 59.    , 60.    , 33.    , 17.    , 11.    ,
       14.    , 49.    , 76.    , 46.    , 27.    , 64.    , 55.    ,
       70.    , 38.    , 51.    , 31.    ,  4.    , 54.    , 23.    ,
       43.    , 52.    , 16.    , 32.5   , 21.    , 15.    , 65.    ,
       28.5   , 45.5   , 56.    , 13.    , 61.    , 34.    ,  6.    ,
       57.    , 62.    , 67.    ,  1.    , 12.    , 20.    ,  0.8333,
        8.    ,  0.6667,  7.    ,  3.    , 36.5   , 18.5   ,  5.    ,
       66.    ,  9.    ,  0.75  , 70.5   , 22.5   ,  0.3333,  0.1667,
       40.5   , 10.    , 23.5   , 34.5   , 20.5   , 30.5   , 55.5   ,
       38.5   , 14.5   , 24.5   , 60.5   , 74.    ,  0.4167, 11.5   ,
       26.5   ])

###### ê¸°ì´ˆ í†µê³„ëŸ‰ ( descriptive statistic ) í™•ì¸

In [152]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

## ë°ì´í„° ê´€ë ¨ ìš©ì–´

<img src="./images/ë³€ìˆ˜.jpg" height = "60%" width = "60%" align = "left" >

<img src="./images/ë°ì´í„°í¬ì¸íŠ¸.jpg" height = "60%" width = "60%" align = "left" >

<img src="./images/ì†ì„±ì—ë”°ë¥¸ë¶„ë¥˜.jpg" height = "60%" width = "60%" align = "left" >

<img src="./images/ì†ì„±ì—ë”°ë¥¸ë¶„ë¥˜2.jpg" height = "70%" width = "70%" align = "left" >

- ë²”ì£¼í˜• ë°ì´í„°
    - ëª…ëª©í˜• ë°ì´í„°(Nominal Data) : ë‚˜ì´, í˜ˆì•¡í˜•, ì‹œë„ ë“± 
        - íƒ€ì´íƒ€ë‹‰ : ì‚¬ë§/ìƒì¡´(0/1) 
    - ìˆœì„œí˜• ë°ì´í„°(Ordinal Data) 
        - í•™ì (3.0 ~ 3.5 : B, 3.5 ~ 4.0 : B+), ë¹„ë§Œë„(BMI 20 ~ 28 : ì •ìƒ ... ) â¤ __ìˆ˜ì¹˜í˜• ìë£Œë¥¼ ê·¸ë£¹í™”__í•  ìˆ˜ ìˆëŠ” ê²ƒ
        - ex) íƒ€ì´íƒ€ë‹‰ -> pclass, embarked 
- ìˆ˜ì¹˜í˜• ë°ì´í„° ( Numerical Data ) -> ì—°ì†í˜• 
    - ì´ì‚°í˜• ë°ì´í„°(Discretive Data) : ì…€ ìˆ˜ ìˆëŠ” ë°ì´í„° 
    - ì—°ì†í˜• ë°ì´í„°(Continuous Data) : ì—°ì†ì ì¸ ì†ì„±ì„ ê°–ëŠ” ìë£Œ

## 6. ë°ì´í„°í”„ë ˆì„ ì •ë ¬ 
- sort_values : ê°’ìœ¼ë¡œ í•˜ëŠ” ì •ë ¬
- sort_index : ì¸ë±ìŠ¤ë¡œ í•˜ëŠ” ì •ë ¬

### 6.1 sort_values(asecnding = False) / sort_index()
- default : ì˜¤ë¦„ì°¨ìˆœ -> ascending = True 
- * ë°ì´í„°í”„ë ˆì„ì—ì„œì˜ sort_values 
    - ì˜µì…˜ìœ¼ë¡œ by = ì»¬ëŸ¼ ì‚¬ìš© ê°€ëŠ¥

In [4]:
s = pd.Series(np.random.randint(6, size=100))
s.head()

0    3
1    4
2    3
3    3
4    5
dtype: int64

###### sort_counts() / sort_index()

In [5]:
s.value_counts().sort_index()

0    17
1    18
2    10
3    19
4    19
5    17
dtype: int64

In [6]:
s.sort_values(ascending = False).head()

36    5
88    5
75    5
33    5
81    5
dtype: int64

In [7]:
s.sort_values(ascending=False).head()

36    5
88    5
75    5
33    5
81    5
dtype: int64

In [19]:
s.name = 'randint'
s.sort_values(by 'randint')

SyntaxError: invalid syntax (<ipython-input-19-7123e81f7e53>, line 2)

In [14]:
titanic['age'].sort_values(ascending = False)

14      80.0
61      76.0
1235    74.0
9       71.0
135     71.0
        ...
1293     NaN
1297     NaN
1302     NaN
1303     NaN
1305     NaN
Name: age, Length: 1309, dtype: float64

In [22]:
titanic.sort_values('age', ascending = False)[['pclass', 'name']]

      pclass                                               name
14         1               Barkworth, Mr. Algernon Henry Wilson
61         1  Cavendish, Mrs. Tyrell William (Julia Florence...
1235       3                                Svensson, Mr. Johan
135        1                          Goldschmidt, Mr. George B
9          1                            Artagaveytia, Mr. Ramon
...      ...                                                ...
1293       3                  Williams, Mr. Howard Hugh "Harry"
1297       3                             Wiseman, Mr. Phillippe
1302       3                                  Yousif, Mr. Wazli
1303       3                              Yousseff, Mr. Gerious
1305       3                              Zabour, Miss. Thamine

[1309 rows x 2 columns]

In [23]:
titanic.sort_values('age', ascending = False)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks"
61,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S,6,NaN,"Little Onn Hall, Staffs"
1235,3,0,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S,NaN,NaN,NaN
135,1,0,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,NaN,NaN,"New York, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1293,3,0,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.0500,NaN,S,NaN,NaN,NaN
1297,3,0,"Wiseman, Mr. Phillippe",male,NaN,0,0,A/4. 34244,7.2500,NaN,S,NaN,NaN,NaN
1302,3,0,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN,C,NaN,NaN,NaN
1303,3,0,"Yousseff, Mr. Gerious",male,NaN,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN

###### sort_values([ì»¬ëŸ¼1, ì»¬ëŸ¼2, ...], ascending = True)[[ ì»¬ëŸ¼a, ì»¬ëŸ¼b, ì»¬ëŸ¼c]]....
- sort_valuesí•  ë•Œ, 
    - ì»¬ëŸ¼1ì— ëŒ€í•´ ì •ë ¬ 
           - ì»¬ëŸ¼2ì— ëŒ€í•´ ì •ë ¬
    - í›„ ì´ ê¸°ì¤€ì— ë”°ë¼ ì»¬ëŸ¼a, ì»¬ëŸ¼b, ì»¬ëŸ¼cì— ëŒ€í•´ ë³´ì—¬ì¤Œ 
- ì•„ë˜ì˜ ê²½ìš°, ë‚˜ì´ë¥¼ ë¨¼ì € ì •ë ¬
    - ì´í›„ ë‚˜ì´ì— ë”°ë¼ pclassë¥¼ ì •ë ¬

In [28]:
a = titanic.sort_values(['age', 'pclass'], ascending = False)[['age', 'pclass', 'name']]
a.head(20)

       age  pclass                                               name
14    80.0       1               Barkworth, Mr. Algernon Henry Wilson
61    76.0       1  Cavendish, Mrs. Tyrell William (Julia Florence...
1235  74.0       3                                Svensson, Mr. Johan
9     71.0       1                            Artagaveytia, Mr. Ramon
135   71.0       1                          Goldschmidt, Mr. George B
727   70.5       3                               Connors, Mr. Patrick
506   70.0       2                        Mitchell, Mr. Henry Michael
81    70.0       1                       Crosby, Capt. Edward Gifford
285   67.0       1                                 Straus, Mr. Isidor
594   66.0       2                              Wheadon, Mr. Edward H
782   65.0       3                                   Duane, Mr. Frank
205   65.0       1                          Millet, Mr. Francis Davis
221   65.0       1                     Ostby, Mr. Engelhart Cornelius
78    64.0       1  Compton, Mrs. Alexander Taylor (Mary Eliza Ing...
83    64.0       1  Crosby, Mrs. Edward Gifford (Catherine Elizabe...
115   64.0       1                                  Fortune, Mr. Mark
217   64.0       1                       Nicholson, Mr. Arthur Ernest
303   64.0       1                           Warren, Mr. Frank Manley
1261  63.0       3                             Turkula, Mrs. (Hedwig)
455   63.0       2                               Howard, Mr. Benjamin

### 7. ì‚¬ìš©ì ì •ì˜ í•¨ìˆ˜ : apply - lambda 
- df.apply( ì‚¬ìš©ì ì •ì˜ í•¨ìˆ˜, axis = 0/1 )

In [33]:
df = pd.DataFrame({ 
    'A': [1, 3, 4, 3, 4], 
    'B': [2, 3, 1, 2, 3], 
    'C': [1, 5, 2, 4, 4]
}) 

df

          0         1         2         3
0  0.587093 -1.295827  0.884618 -0.431438
1  1.144573  0.475028 -1.426634  0.817056
2  0.033610 -1.185936 -1.162776  1.934844
3  1.386708  0.436880  1.790480 -1.005622
4 -0.183660 -0.557082  0.500342 -0.282008
5 -1.029662 -0.094118 -2.672307  0.440623

###### Columnì— ëŒ€í•´ ì—°ì‚° 
- í•´ë‹¹ ì—°ì‚°ë§Œ axis = 1 ì¼ ê²½ìš° ì—´

In [40]:
df.apply(lambda x : x.max() - x.min())

0    2.416370
1    1.770855
2    4.462787
3    2.940466
dtype: float64

In [41]:
df.apply(lambda x : x.max() - x.min(), axis = 1)

0    2.180446
1    2.571207
2    3.120779
3    2.796103
4    1.057424
5    3.112930
dtype: float64

In [46]:
df

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [48]:
df.value_counts

AttributeError: 'DataFrame' object has no attribute 'value_counts'

___

# Aì—´ì— 1ì€ ëª‡ ê°œ, 2ëŠ” ëª‡ ê°œ, 3ì€ ëª‡ ê°œ.. ì— ëŒ€í•œ ê°’  âˆ‡

# ?????????????????????????????????????

In [51]:
df.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

___

In [63]:
titanic['survived'] = titanic['survived'].apply(lambda x : 'survived' if x == 0 else 'died').head(10)
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,died,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,died,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,survived,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,survived,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,survived,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,NaN,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,NaN,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,NaN,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,NaN,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,NaN,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN